tako-dev/takoquota-hardware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-PICO-1-N8R8: 8MB embedded flash, 8MB embedded PSRAM.
#
# PSRAM is left disabled: this demo needs 5KB for the framebuffer, and enabling
# quad PSRAM here fails ID detection on this module ("PSRAM ID read error:
# 0x00ffffff") and reboot-loops. Not worth chasing for a display test.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Log over the native USB-Serial-JTAG port
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
